# <font color = brown><h1 align='centre'>preprocessing of the Data</h1></font>

# <font color = pink><h1 align='centre'>steps involved in data pre-processing</h1></font>

# 1.Importing libraries
# 2.Importing the data set
# 3.missing values
# 4.categorical data
# 5.splitting data
# 6.feature scaling

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn

# importing the data set

In [2]:
##importing the dataset
data=pd.read_table("http://bit.ly/movieusers")
data

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [3]:
#the top output is combined we need to split them
#we can use sep
#and to have it in a proper strcuture
data=pd.read_table("http://bit.ly/movieusers",sep="|")
data

       1  24  M     technician  85711
0      2  53  F          other  94043
1      3  23  M         writer  32067
2      4  24  M     technician  43537
3      5  33  F          other  15213
4      6  42  M      executive  98101
..   ...  .. ..            ...    ...
937  939  26  F        student  33319
938  940  32  M  administrator  02215
939  941  20  M        student  97229
940  942  48  F      librarian  78209
941  943  22  M        student  77841

[942 rows x 5 columns]

In [4]:
#the top output columns names are not headers it also comes under data so move that header into the data
#we use header as header="None"
data=pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data

       0   1  2              3      4
0      1  24  M     technician  85711
1      2  53  F          other  94043
2      3  23  M         writer  32067
3      4  24  M     technician  43537
4      5  33  F          other  15213
..   ...  .. ..            ...    ...
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

[943 rows x 5 columns]

# Handling the missing values

In [5]:
#instead of using 100 of rows we can work on a small data set frst so use this link for now to work with a small data
#"https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv"
#this top link has 7 rows which is a small data set use this small data set for now to understand about handling concepts
df=pd.read_table("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",sep=",")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [6]:
df.day.dtype

dtype('O')

In [7]:
type(df.day[0])

str

##### as it is not str we need to convert the column to data format by handing it

In [8]:
#we have duplicate values so u cant directly delete or remove their columns
df.duplicated()
#it is showing false because only two columns are same not all four clumns so thts y it shows false
#when we are checking it for total data set

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [9]:
#to get the duplicate values of a particular columns
df[df['temperature'].duplicated()]
#this shows the duplicate columns

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [10]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [11]:
#count for the particular columns
df['temperature'].value_counts()

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [12]:
#if u want to change the date column into the str date format
df=pd.read_table("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",sep=",",parse_dates=['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [13]:
df.day.dtype

dtype('<M8[ns]')

In [14]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [15]:
#for replacing any values
new_df=df.replace({'temperature':-99999,'windspeed':-99999,'event':'0'},np.nan)
new_df
#the values are now replaced with NaN

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

## Imputation:imputation is a process of subtituting the missing values

In [16]:
new_df.isnull().sum()
#isnull() gives false if there are no missing values
#gives true if there is missing values
#sum() gives the no of missing values for each column

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [17]:
#fillna()->i used to fill the missing data
data=new_df.fillna(0)
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [18]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [19]:
#ffill->forward fill which fills the missing values with the previous column values
f_data=new_df.fillna(method='ffill')
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [20]:
#bfill-->back fill here the missing values will get replaced with the next column values
b_data=new_df.fillna(method='bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [21]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [24]:
#mean imputation
mean_data=new_df.fillna(new_df.mean())
mean_data
#this took only the mean for the numerical columns but not for the text data
#thats y event column still has the Nan values

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [25]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [27]:
# median imputation
#filling the missing values with the median values
median_data=new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [28]:
new_df.event.mode()
#new_df.event.mode().iloc[0]-->rain
#new_df.event.mode().iloc[1]-->sunny
#rain and sunny because they are repeated twice

0     Rain
1    Sunny
dtype: object

In [35]:
#making permanent changes for event column with mode
new_df['event']=new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df
#here we used iloc[0] so missing values are replaced with rain

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

In [36]:
#after making changes the event columns mode is rain 
new_df.event.mode()

0    Rain
dtype: object

# problm solving questions

###### questionlink:https://docs.google.com/document/d/1WrkWFmmhCmX8Oi9Aw6uLhw0zU5IvTfYjJoVJIXzN_WM/edit

In [39]:
# question 12 
# magic square

example:
   - 19	7	19	93
   - 94	18	4	22
   - 5	21	95	17
   - 20	92	20	6

- sum of columns is 138
- sum of rows is 138
- sum of both forward and backward diagonal elements sum is 138
- sum of middle square is 138
- sum of all 4 squares is 138
- sum of corner elements sum is 138

In [40]:
import numpy as np
arr1=np.array([[19,7,19,93],
               [94,18,4,22],
               [5,21,95,17],
               [20,92,20,6]])

In [45]:
#sum of middle square is 138
s=0
for i in range(1,3):
    for j in range(1,3):
        s +=arr1[i,j]
s

138

In [41]:
#sum of columns is 138
arr1.sum(axis=1)

array([138, 138, 138, 138])

In [42]:
#sum of rows is 138
arr1.sum(axis=0)

array([138, 138, 138, 138])

In [43]:
#sum of both forward and backward diagonal elements sum is 138
arr1.trace(axis1=1,axis2=0)

138

In [46]:
#or
arr1.trace(axis1=0,axis2=1)

138

In [47]:
#sum of corner elements is 138
arr1[0,0]+arr1[0,3]+arr1[3,0]+arr1[3,3]

138

In [53]:
#sum of frst square
print(arr1[0,0]+arr1[0,1]+arr1[1,0]+arr1[1,1])

s=0
for i in range(2):
    for j in range(2):
        s+=arr1[i,j]
print(s)

138
138